000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВариантыОтчетов/ВариантыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтчетов</name>
  <attributes>
    <name>Отчет</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтчета</name>
    <type>
      <types>EnumRef.ТипыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючВарианта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредопределенныйВариант</name>
    <comment>Вариант конфигурации</comment>
    <type>
      <types>CatalogRef.ПредопределенныеВариантыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользовательский</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьПоУмолчаниюПереопределена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Размещение</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазделИлиГруппа</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Важный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СмТакже</name>
      <comment>Вариант находится в группе &quot;См. также&quot;</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПредопределенная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьНазвание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПодсистема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьИсключенияБыстрогоДоступа</name>
    <attributes>
      <name>УдалитьПользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonForms/РекомендуемыеОтчеты/Module.bsl
&НаКлиенте
Процедура СверкаПеремещенийИОрдеров(Команда)
	
	//Предоределенный вариант отчета
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	//ПараметрыОткрытия.Вставить("КлючПараметровПечати", Уникальность);
	//ПараметрыОткрытия.Вставить("КлючСохраненияПоложенияОкна", Уникальность);
	
	//ОткрытьФорму(ЭлементСписка.Значение, ПараметрыОткрытия);
	ОткрытьФорму("Отчет.СверкаПеремещенийИОрдеров.Форма", ПараметрыОткрытия);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПоПроектам(Команда)
	
	//Пользовательский вариант отчета
	СтандартнаяОбработка = Ложь;
	
	Вариант = "ПРОДАЖИ ЗА ПЕРИОД  по проектам";
	ВариантОбъект = ПолучитьОбъектВарианта(Вариант,"Продажи");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", ВариантОбъект.КлючВарианта);
	ОткрытьФорму("Отчет.Продажи.Форма", ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура Продажи(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", "Продажи");
	ОткрытьФорму("Отчет.Продажи.Форма", ПараметрыОткрытия);


КонецПроцедуры


&НаСервере
Функция ПолучитьОбъектВарианта(Вариант, ИмяОтчета)
	
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтчетов.Отчет,
		|	ВариантыОтчетов.КлючВарианта,
		|	ВариантыОтчетов.Наименование
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		|ГДЕ
		|	НЕ ВариантыОтчетов.ПометкаУдаления
		|	И ВариантыОтчетов.Отчет.Имя = &Отчет
		|	И ВариантыОтчетов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Вариант);
	//Запрос.УстановитьПараметр("Отчет", Метаданные.Отчеты[ИмяОтчета]);
	Запрос.УстановитьПараметр("Отчет", ИмяОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Новый Структура("КлючВарианта", ВыборкаДетальныеЗаписи.КлючВарианта); 
	Иначе
		Возврат Новый Структура("КлючВарианта", ""); 
	КонецЕсли;
	
	

	 //ВариантОбъект = Вариант.ПолучитьОбъект();
	 //Возврат Новый Структура("КлючВарианта, ИмяОтчета", Вариант.КлючВарианта, Вариант.Отчет.Имя); 

 КонецФункции 
 
 
&НаКлиенте
Процедура АнализСостоянияПодарочныхСертификатов(Команда)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", "АнализОстаткиМагазина");
	ОткрытьФорму("Отчет.АнализСостоянияПодарочныхСертификатов.Форма", ПараметрыОткрытия);

 КонецПроцедуры


 
&НаКлиенте
Процедура ВедомостьДвиженияПодарочныхСертификатов(Команда)

	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПодарочныеСертификатыДвижения");
	 ОткрытьФорму("Отчет.ДвиженияПодарочныхСертификатов.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ДействующиеМаркетинговыеАкции(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ДействующиеМаркетинговыеАкции");
	 ОткрытьФорму("Отчет.ДействующиеМаркетинговыеАкции.Форма", ПараметрыОткрытия);
 КонецПроцедуры

&НаКлиенте
 Процедура ОтчетПоОстаткамТовараВАкциях(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Отчет по остаткам, участвующим в акциях");
	 ОткрытьФорму("Отчет.ОтчетПоОстаткамТовараВАкциях.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ПродажиПоДисконтнымКартамЧекаККМ(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПродажиПоДисконтнымКартамЧекаККМ");
	 ОткрытьФорму("Отчет.ПродажиПоДисконтнымКартамЧекаККМ.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ЦеныПоВидамЦен(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.ЦеныПоВидамЦен.Форма", ПараметрыОткрытия);
 КонецПроцедуры


&НаКлиенте
 Процедура ПричиныВозвратовПоставщикам(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПричиныВозвратовПоставщикам");
	 ОткрытьФорму("Отчет.ПричиныВозвратовПоставщикам.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура АнализРасхожденийПриПоступленииТоваров(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "АнализРасхожденийПриПоступленииТоваров");
	 ОткрытьФорму("Отчет.АнализРасхожденийПриПоступленииТоваров.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ИнформационныеОстаткиВМагазинах(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОстаткиВМагазинахИНаЦентральныхСкладах");
	 ОткрытьФорму("Отчет.ИнформационныеОстаткиВМагазинах.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ОстаткиТоваровОрганизаций(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОстаткиТоваровОрганизаций");
	 ОткрытьФорму("Отчет.ВедомостьПоТоварамОрганизаций.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ПродажиОстаткиТовараВДняхТорговли(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПродажиОстаткиТовараВДняхТорговли");
	 ОткрытьФорму("Отчет.ПродажиОстаткиТовараВДняхТорговли.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура МинусовыеОстатки(Команда)
	 СтандартнаяОбработка = Ложь;
	
	Вариант = " МИНУСОВЫЕ ОСТАТКИ";
	ВариантОбъект = ПолучитьОбъектВарианта(Вариант,"ВедомостьПоТоварамНаСкладах");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", ВариантОбъект.КлючВарианта);
	
	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура АнализДвиженийПоМагазинам(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПоМагазинам");
	 ОткрытьФорму("Отчет.АнализДвиженийНоменклатуры.Форма", ПараметрыОткрытия);
 КонецПроцедуры

&НаКлиенте
 Процедура ВедомостьПоТоварамНаСкладах(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ДвиженияСГруппировкойПоСкладам");
	 ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", ПараметрыОткрытия);
 КонецПроцедуры

&НаКлиенте
 Процедура ПродажиПоПроектамЗаПериод(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПродажиПоПроектам");
	 ОткрытьФорму("Отчет.Продажи.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ОстаткиНаСкладах(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОстаткиНаСкладах");
	 ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура СтоимостнаяОценкаСкладаВРозничныхЦенах(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "СтоимостнаяОценкаСкладаВРозничныхЦенах");
	 ОткрытьФорму("Отчет.СтоимостнаяОценкаСклада.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ОтчетПоПересортицеПоСписанию(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОтчетПоПересортицеПоСписанию");
	 ОткрытьФорму("Отчет.ОтчетПоПересортице.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ДвиженияДенежныхСредствВКассахККМ(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ДвиженияДенежныхСредств");
	 ОткрытьФорму("Отчет.ОстаткиИДвиженияДенежныхСредствВКассахККМ.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ДвиженияДСПоПлатежнымКартам(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ДвиженияДенежныхСредствПоПлатежнымКартам");
	 ОткрытьФорму("Отчет.ДвиженияДенежныхСредствПоПлатежнымКартам.Форма", ПараметрыОткрытия);
 КонецПроцедуры

&НаКлиенте
 Процедура ДвиженияДСПоТипамОплат(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ДвиженияДенежныхСредствПоТипамОплат");
	 ОткрытьФорму("Отчет.ДвиженияДенежныхСредствПоТипамОплат.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ЖелтыйОтчет(Команда)
	  ОткрытьФорму("Отчет.ЖелтыйОтчет.Форма");
 КонецПроцедуры

&НаКлиенте
 Процедура ОтчетПоЧекамККМ(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОтчетПоЧекамККМ");
	 ОткрытьФорму("Отчет.ОтчетПоЧекамККМ.Форма", ПараметрыОткрытия);
 КонецПроцедуры

&НаКлиенте
 Процедура ВедомостьПоОплатамПлатежнымиКартами(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОплатыКредитнымиКартами");
	 ОткрытьФорму("Отчет.ВедомостьПоОплатамПлатежнымиКартами.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ВозвратовОтПокупателяДетально(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПричиныВозвратовДетальный");
	 ОткрытьФорму("Отчет.ПричиныВозвратовОтПокупателя.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура СверкаРучныхСкидокИПодарочныхСертификатов(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.СверкаРучныхСкидокИПодарочныхСертификатов.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ОтчетЭмитентуПоПодарочнымСертификатам(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОтчетЭмитентуПоПодарочнымСертификатам");
	 ОткрытьФорму("Отчет.ОтчетЭмитентуПоПодарочнымСертификатам.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура НаличныеДенежныеСредства(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "НаличныеДенежныеСредства");
	 ОткрытьФорму("Отчет.ОстаткиИДвиженияДенежныхСредств.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ПродажиБезПодарочныхСертификатов(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПродажиБезПодарочныхСертификатов");
	 ОткрытьФорму("Отчет.Продажи.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ПродажиПоДисконтнымКартам(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПродажиПоДисконтнымКартам");
	 ОткрытьФорму("Отчет.ПродажиПоДисконтнымКартам.Форма", ПараметрыОткрытия);
	
 КонецПроцедуры


&НаКлиенте
 Процедура ПродажиПоПродавцам(Команда)
	 //Пользовательский вариант отчета
	СтандартнаяОбработка = Ложь;
	
	Вариант = "ПРОДАЖИ ПО ПРОДАВЦАМ";
	ВариантОбъект = ПолучитьОбъектВарианта(Вариант,"Продажи");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", ВариантОбъект.КлючВарианта);
	ОткрытьФорму("Отчет.Продажи.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура РеестрАннулированныхЧеков(Команда)
	 ОткрытьФорму("Отчет.РеестрАннулированныхЧеков.Форма");

 КонецПроцедуры


&НаКлиенте
 Процедура ОстаткиИДвиженияДенежныхСредствВКассахККМ(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ДвиженияДенежныхСредствСРасшифровкойПоРегистратору");
	 ОткрытьФорму("Отчет.ОстаткиИДвиженияДенежныхСредствВКассахККМ.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура ДвиженияДенежныхСредствПоСтатьям(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ОборотДДС");
	 ОткрытьФорму("Отчет.ДвиженияДенежныхСредствПоСтатьям.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура ДниРожденияДетей(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.СписокДетейИДнейРождения.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура ПродажиТоваровПоЧекамККМ(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПродажиТоваровПоЧекамККМ");
	 ОткрытьФорму("Отчет.ПродажиТоваровПоЧекамККМ.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура РеестрЧековВозврата(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "РеестрЧековВозврата");
	 ОткрытьФорму("Отчет.ПродажиТоваровПоЧекамККМ.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура ПричиныРучныхСкидок(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ПричиныРучныхСкидок");
	 ОткрытьФорму("Отчет.ПродажиТоваровПоЧекамККМ.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура ВозвратТовараПоЧекамККМ(Команда)
	 //Пользовательский вариант отчета
	СтандартнаяОбработка = Ложь;
	
	Вариант = "Возврат товара по чекам ККМ";
	ВариантОбъект = ПолучитьОбъектВарианта(Вариант,"ПродажиТоваровПоЧекамККМ");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", ВариантОбъект.КлючВарианта);
	ОткрытьФорму("Отчет.ПродажиТоваровПоЧекамККМ.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура СписокДетейИДнейРождения(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.СписокДетейИДнейРождения.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура СписокДискотниковПоМагазинам(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.СписокДискотниковПоМагазинам.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура ЛиквидностьТовара(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.ЛиквидностьТовара.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
Процедура КонверсияПосетителейДень(Команда)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", "КонверсияПосетителейДень");
	ОткрытьФорму("Отчет.КонверсияПосетителей.Форма", ПараметрыОткрытия);

КонецПроцедуры


&НаКлиенте
Процедура КонверсияПосетителейДеньЧас(Команда)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", "КонверсияПосетителейДеньЧас");
	ОткрытьФорму("Отчет.КонверсияПосетителей.Форма", ПараметрыОткрытия);

КонецПроцедуры


&НаКлиенте
 Процедура ПродажиПланФакт(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.ПродажиПланФакт.Форма", ПараметрыОткрытия);

 КонецПроцедуры


&НаКлиенте
 Процедура АнализДвиженийТоваровПоБрендам(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "ДвиженияСГруппировкойПоБрендам");
	 ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма", ПараметрыОткрытия);

 КонецПроцедуры

&НаКлиенте
 Процедура ОтчетПоПродажамВРазрезеПроектовИЧеков(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.ОтчетПоПродажамВРазрезеПроектовИЧеков.Форма", ПараметрыОткрытия);

 КонецПроцедуры

 //	LNK 11.05.2017 13:35:50
&НаКлиенте
 Процедура ПродажиИнтернетМагазина(Команда)

//	 ОткрытьФорму("Отчет.ПродажиИнтернетМагазина.Форма", Новый Структура("КлючВарианта", "ПродажиПроекты"));
	 ОткрытьФорму("Отчет.ПродажиИнтернетМагазина.Форма");

 КонецПроцедуры

&НаКлиенте
 Процедура ЛиквидностьТовараСЦеной(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
	 ОткрытьФорму("Отчет.ЛиквидностьТовараСЦеной.Форма", ПараметрыОткрытия);
 КонецПроцедуры

&НаКлиенте
Процедура АнализОстатковИПродажПроекты(Команда)

	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "АнализОстатковИПродажПроекты");
	 ОткрытьФорму("Отчет.АнализОстатковИПродаж.Форма", ПараметрыОткрытия,, ПараметрыОткрытия.КлючВарианта);

 КонецПроцедуры

&НаКлиенте
 Процедура АнализОстатковИПродажНоменклатура(Команда)

	 ПараметрыОткрытия = Новый Структура(
	 	"КлючВарианта", "АнализОстатковИПродажНоменклатура");
	 ОткрытьФорму("Отчет.АнализОстатковИПродаж.Форма", ПараметрыОткрытия,, ПараметрыОткрытия.КлючВарианта);

 КонецПроцедуры

&НаКлиенте
 Процедура ОплатыКредитнымиКартамиПоБанку(Команда)
	 ПараметрыОткрытия = Новый Структура;
	 ПараметрыОткрытия.Вставить("КлючВарианта", "f67cbdf4-27c7-4424-a60c-b73db68a477b");
	 ОткрытьФорму("Отчет.ВедомостьПоОплатамПлатежнымиКартами.Форма", ПараметрыОткрытия,, ПараметрыОткрытия.КлючВарианта);
 КонецПроцедуры

&НаКлиенте	//	LNK 04.01.2021 09:30:10
Процедура АнализСкладскихДокументов(Команда)

	ОткрытьФорму("Отчет.АнализСкладскихДокументов.Форма");

КонецПроцедуры
